In [45]:
import pandas as pd

In [46]:
data = [['Ary' , 'M' , '21'],
        ['Catia' , 'F', '19'],
        ['Carlos', 'M' , '50'],
        [ 'Beto', 'M' , '29'],
        [ 'Bruna', 'F', "21"],
        [ "Ana", "F" , "42"]]

data

[['Ary', 'M', '21'],
 ['Catia', 'F', '19'],
 ['Carlos', 'M', '50'],
 ['Beto', 'M', '29'],
 ['Bruna', 'F', '21'],
 ['Ana', 'F', '42']]

In [47]:
columns= ['Nome', 'Sexo', 'Idade']
columns

['Nome', 'Sexo', 'Idade']

In [48]:
index =  [str(i+1) for i in range(6)]
index

['1', '2', '3', '4', '5', '6']

In [49]:
df_A = pd.DataFrame(data, index, columns)
df_A

     Nome Sexo Idade
1     Ary    M    21
2   Catia    F    19
3  Carlos    M    50
4    Beto    M    29
5   Bruna    F    21
6     Ana    F    42

In [75]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])

In [76]:
df_B

     Nome Sexo Idade
6     Ana    F    42
5   Bruna    F    21
2   Catia    F    19
1     Ary    M    21
4    Beto    M    29
3  Carlos    M    50